tutorials/10steadyBBEnclosed/ITHACAoutput/Offline/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0.01;
    }

  /*  p_rgh
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-5;
        relTol          0.01;
    }*/

    p_rghFinal
    {
        $p_rgh;
        relTol          0.01;
    }

    Tlift0
    {
	solver           GAMG;
        tolerance        1e-3;
        relTol           0;
        smoother         symGaussSeidel;
    }

    Tlift1
    {
	solver           GAMG;
        tolerance        1e-6;
        relTol           0;
        smoother         symGaussSeidel;
    }

"(U|k|epsilon|omega|f|v2|T|nuTilda)"
    {

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-05;
        relTol          0.1;
   
	/*solver           GAMG;
        tolerance        1e-35;
        relTol           0.001;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;*/
    }

/*
    "(U|T|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-5;
        relTol          0.01;
    }*/

    "(U|T|R)Final"
    {
        $U;
        relTol          0.1;
    }

 Phi
    {
        $p;
    }

    Usup
    {
        type            coupled;  // optional, defaults to segregated
        solver          PBiCCCG;
        preconditioner  DILU;
        tolerance       (1e-06 1e-06 1e-06);
        relTol          (0 0 0);
    }

}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 2;
}

//SIMPLE
//{
//    nNonOrthogonalCorrectors 0;
//    nOuterCorrectors    2;
//    nCorrectors         2;
//    pRefCell 0;
//    pRefValue 0;

 //residualControl
 //   {
 //       p_rgh           1e-1;
 //       U               1e-4;
   //     T               1e-2;
//
        // possibly check turbulence fields
 //       "(k|epsilon|omega)" 1e-3;
  //  }
//}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
pRefCell 0;
   pRefValue 0;
    consistent      yes;

//residualControl
 //   {
 //       p_rgh           1e-1;
  //      U               1e-1;
  //      T               1e-1;

        // possibly check turbulence fields
  //      "(k|epsilon|omega)" 1e-3;
 //   }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}


PIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    nCorrectors     2;
    pRefCell        0;
    pRefValue       0;
}


relaxationFactors
{
    fields
    {
        p_rgh           0.7;
    }
    equations
    {
        U               0.3;
        T               0.5;
        "(k|epsilon|R)" 0.7;
    }
}

// ************************************************************************* //
